{"dim": 768, "next_int_id": 4, "id_to_int": {"7_58f022b7eae540f398acf89496879673_0": 1, "1_c0eaa35433c44453b7549d0eabe28a72_0": 2, "1_34c88b70055f4c31b483a79072d96fb0_1": 3}, "metadata": {"7_58f022b7eae540f398acf89496879673_0": {"doc_id": 7, "chunk_index": 0, "chunk_text": "hello"}, "1_c0eaa35433c44453b7549d0eabe28a72_0": {"doc_id": 1, "chunk_index": 0, "chunk_text": "CHANTI LINGAMAIAH Kadapa, Andhra Pradesh, India,517172 PROFILE SUMMARY: Full Stack Developer (Entry -Level) skilled in React.js, Node.js, Express.js, Python, and SQL. Experienced in building responsive UIs, integrating RESTful APIs, and implementing secure authentication (JWT). Strong in data structures, debugging, and clean code practices, with ha nds-on experience delivering scalable web applications using modern development tools. TECHNICAL PROFICIENC Y : ● Frontend: React.js, React Router, React Hooks, JavaScript (ES6+), HTML5 .0, CSS -in-JS (styled - components ), Bootstrap , Responsive UI . ● Languages & Back -end: Node.js, Express.js, Python, REST APIs, JSON, JWT .MongoDB ● Databases: SQL (CRUD, queries), data modelling, MySQL / ● Development Tools: Git, GitHub, Chrome DevTools, JWT,VS Code ● Software Engineering Practices : OOP, Data Structures & Algorithms, REST APIs ,Responsive Design, State Management ,error handling,debugging ● Professional Skills: Verbal ,Witten & Communication,Collaboration,Problem -Solving, Adaptability & Learning , Analytical Thinking ● Methodologies: Troubleshooting & Debugging EDUCATIONDETAILS: ● B.Tech in ECE from Sri Krishna Devaraya University, Anantapur ( 2021 – 2025 ) – CGPA: 8.3 ● Intermediate (MPC) from Sri Sai Ram Junior College, Kadapa ( 2019 – 2021 ) – 97% ● SSC from Z.P.H.S Lakshmipeta, Kadapa (2018 – 2019) – CGPA: 9.7 PROJ ECT DETAILS: Project Name: FoodieHub | Github ● Developed a f ull-stack food ordering platform using React, Node.js, Express, and MySQL, allowing users to explore restaurants and menus seamlessly. ● Implemented secure user authentication with JWT tokens, enabling signup, login, and logout functionalities. ● Built restaurant and menu browsing features with category -based filtering and intuitive UI. (+91)6302024304, chantilingamaiah@gmail.com . Kadapa, Andhra Pradesh, India PIN -516172. ● Integrated RESTful APIs for user sessions, menu data retrieval, cart operations, and order tracking. ● Designed a responsive React frontend with dynamic cart updates and smooth navigation. Tech: React.js Hooks , Node.js, Express.js, MySQL, JWT, CSS, REST APIs, Full -Stack Development Project Name: Trendz – E-Commerce Platform | LiveDemo ● Built a responsive e -commerce frontend using React.js , React Router and reusable components for product listings and details. ● Integrated REST APIs for product data and implemented JWT -based session handling with LocalStorage. ● Improved UI performance by minimizing unnecessary renders and optimizing component design. Tech stack: React.js, JavaScript, CSS -in-JS (styled -components ), Bootstrap, REST APIs, JWT, Local Storage. Project Name: BankLite – Command -Line Banking Application in Python | GitHub ● Designed and developed a command -line banking system in Python allowing users to create accounts, log in securely , and perform banking operations. ● Built features for deposits, withdrawals, balance enquiries, and transaction validation to ensure accurate financial records . ● Created a user -friendly, menu -driven interface to guide users through all available operations without prior technical knowledge. ● Built a menu -driven interface to simplify operations and added robust error handling to avoid runtime crashes. Tech stack: Python, Pycharm, JSON PROFESSIONAL EXPERIENCE: ReactJS Developer Intern – CodSoft | Certificate Feb 2025 – Mar 2025 ● Implemented reusable, accessible React components and UI modules (product cards, forms, navigation) to accelerate feature rollout. ● Integrated RESTful APIs to fetch and render dynamic data,"}, "1_34c88b70055f4c31b483a79072d96fb0_1": {"doc_id": 1, "chunk_index": 1, "chunk_text": "● Built a menu -driven interface to simplify operations and added robust error handling to avoid runtime crashes. Tech stack: Python, Pycharm, JSON PROFESSIONAL EXPERIENCE: ReactJS Developer Intern – CodSoft | Certificate Feb 2025 – Mar 2025 ● Implemented reusable, accessible React components and UI modules (product cards, forms, navigation) to accelerate feature rollout. ● Integrated RESTful APIs to fetch and render dynamic data, ensuring performance and scalability. ● Managed compone nt state using useState and useEffect, improving data flow and interactivity. ● Integrated REST APIs for dynamic content rendering. ● Managed state using props and useState/ useEffect hooks. ACHIEVEMENTS : ● Tata Scholarship ( 2022 ) Awarded the prestigious Tata Scholarship worth ₹15,000 for outstanding academic performance in Intermediate (Class 12), recognizing academic excellence and consistency."}}}