{"dim": 768, "next_int_id": 8, "id_to_int": {"1_2778f15914784ff2b6f826305e57e30f_0": 1, "1_e610b95034f346dba1135f5cc5643d0f_1": 2, "1_dca46ba3bfd64e79b4ff6bb29ada6d00_2": 3, "2_487c9c26fb5c4e5c8f0f8781cb4ba055_0": 4, "2_d830a10d1bce475a924e4150bd6fea52_1": 5, "3_bc35b95b3c3a460d8d655bd819ef1fcf_0": 6, "3_4a8dc8ff507944ddbffebad755c64dbc_1": 7}, "metadata": {"1_2778f15914784ff2b6f826305e57e30f_0": {"doc_id": 1, "chunk_index": 0, "chunk_text": "CORRIGENDUM NOTICE Ref: DIPR No. 4417PP/CL/Advt/1/1/2021-22 Date: 13.10.2025 In continuation to the advertisement published earlier by the Andhra Pradesh Innovation Society (APIS) under the ITE&C Department, Government of Andhra Pradesh , inviting applications for the posts of Joint Director (Administration & Infrastructure) and Joint Director (Entrepreneurship Development) on a contractual basis dated 11th September 2025 — the following corrigendum is hereby issued: 1 . The post of “Joint Director (Administration & Infrastructure)” is hereby replaced with “Joint Director (Technology)” . The revised role will focus on driving digital transformation, product development, and technology governance across APIS and RTIH. The detailed Job Description and Eligibility Criteria for Joint Director (Technology) are available on the APIS website. Interested and eligible candidates may apply for both the above positions through the official APIS portal : https://www.apis.ap.gov.in The last date for submission of applications for both positions is 31st October 2025 . 2 . An additional position titled “Joint Director – Startup Ecosystem” is hereby created to strengthen startup engagement and innovation programs under APIS and RTIH. The Job Description, Eligibility Criteria, and Application Form for this newly created position to be uploaded soon By Order of the Chief Executive Officer Andhra Pradesh Innovation Society (ITE&C Department, Government of Andhra Pradesh)ITC53-11/2/2025-MNGR - APIS I/4388230/2025 ITC53-11/2/2025-MNGR - APIS I/4388230/2025 Job Description & Eligibility Criteria File No: ITC53-11/2/2025-MNGR – APIS, Dated: 13/10/2025 Job Designation Joint Director, Technology (Contractual Position) No. Vacancies 1 No. Roles Overview The Joint Director – Technology (JD–Tech) will lead the overall technology strategy, digital transformation, and implementation for APIS and RTIH. The role requires a hands-on technologist capable of designing, developing, deploying, and maintaining digital products — including the Startup One Portal, a single- window digital platform integrating government startup incentives, applications, and performance tracking systems. The incumbent will oversee all web platforms, IT infrastructure, cybersecurity, and digital enablement activities for APIS and RTIH, while building and supervising a core internal tech team and external vendors. Key Responsibilities 1 . Product Development & Digital Platforms Conceptualize, architect, and oversee the Startup One Portal – covering startup registration, incentive application, lifecycle tracking, and dashboards for departments and startups. Integrate databases and APIs from departments such as Industries, IT, APIS, and RTIH to create a unified experience. Drive product roadmap, feature prioritization, and ensure UI/UX excellence aligned with APIS brand. Build internal tools for automation, grant management, and startup performance analytics. 2 . Website & Communication Infrastructure Maintain and enhance the company websites – design updates, content management, integration of forms, blogs, and media. Set up and manage digital ecosystem including domain management, email systems, and internal collaboration tools. Ensure consistent digital branding across all online channels and spokes. 3 . Technical Governance & Operations Formulate and enforce tech policies, data protection, and security protocols in compliance with MeitY standards. Oversee hosting, deployment pipelines, version control, and backups for all digital assets.ITC53-11/2/2025-MNGR - APIS I/4388235/2025 4 . Team Building & Vendor Management Hire, mentor, and manage a small tech team (developers, UI/UX designer, system admin). Manage outsourced vendors and consultants for specialized modules or infrastructure. Draft"}, "1_e610b95034f346dba1135f5cc5643d0f_1": {"doc_id": 1, "chunk_index": 1, "chunk_text": "Governance & Operations Formulate and enforce tech policies, data protection, and security protocols in compliance with MeitY standards. Oversee hosting, deployment pipelines, version control, and backups for all digital assets.ITC53-11/2/2025-MNGR - APIS I/4388235/2025 4 . Team Building & Vendor Management Hire, mentor, and manage a small tech team (developers, UI/UX designer, system admin). Manage outsourced vendors and consultants for specialized modules or infrastructure. Draft RFPs and evaluate proposals for tech services, platforms, and integrations. 5 . Innovation & Enablement Identify and onboard AI tools, cloud services, and data analytics solutions that support RTIH’s innovation goals. Support program teams in implementing digital tools for incubations, hackathons, and startup acceleration. Lead the creation of knowledge dashboards for monitoring KPIs across startups, incubators, and spokes. Qualification Criteria Educational Qualification: B.Tech / M.Tech in Computer Science, Information Technology, or related field. Experience: Minimum 8 years in full-stack product development, digital transformation, or technology leadership with hands on experience Preferred Exposure in Cloud deployment (Google Cloud / AWS / Azure), Modern web stacks (React / Node.js / Firebase / Python), Experience in government tech projects (desirable not mandatory) Key Competencies Strong system design and problem-solving capabilities. Excellent communication and project management skills. Proven ability to manage multi-stakeholder coordination (Government–Industry–Academia). Team leadership and vendor management expertise. Demonstrated passion for startups, innovation, and public- sector technology. General Instructions 1 . Nationality: Only Indian Nationals are eligible to apply. 2 . Eligibility Criteria: Candidates must ensure they meet all prescribed eligibility conditions, including educational qualifications, experience, and any other relevant requirements before applying. Applications that do not fulfill the criteria will be rejected without further correspondence. 3 . Educational Qualifications: Applicants should possess a Bachelor’s or higher degree in a relevant discipline from a recognized university. Candidates must have secured a minimum of 60% aggregate marks orITC53-11/2/2025-MNGR - APIS I/4388235/2025 equivalent CGPA in their qualifying degree. Additional certifications, diplomas, or fellowships in the relevant domain will be considered an advantage. 4 . Age Limit: Applicants must be between 30 and 45 years of age as on the closing date of receipt of applications. 5 . Application Completeness: Incomplete applications, applications received after the deadline, or those lacking requisite documents will not be considered. 6 . Verification of Credentials: Candidature will be subject to verification of character and antecedents. Original documents relating to educational qualifications, professional experience, identity proof, and other relevant certificates must be produced at the time of joining or as requested by AP Innovation Society (APIS). Any discrepancies will result in cancellation of candidature. 7 . Right to Cancel: APIS reserves the right to cancel the candidature of any applicant at any stage of recruitment or after appointment if false or misleading information is found or if eligibility conditions are not met. 8 . No TA/DA: No Travel Allowance (TA), Dearness Allowance (DA), or any other incidental expenses will be reimbursed for attending interviews or any stage of the recruitment process. 9 . Final Decision: The Evaluation Committee’s decisions on eligibility, application acceptance/rejection, interview conduct, results, and all recruitment-related matters are final and binding. No further correspondence will"}, "1_dca46ba3bfd64e79b4ff6bb29ada6d00_2": {"doc_id": 1, "chunk_index": 2, "chunk_text": "found or if eligibility conditions are not met. 8 . No TA/DA: No Travel Allowance (TA), Dearness Allowance (DA), or any other incidental expenses will be reimbursed for attending interviews or any stage of the recruitment process. 9 . Final Decision: The Evaluation Committee’s decisions on eligibility, application acceptance/rejection, interview conduct, results, and all recruitment-related matters are final and binding. No further correspondence will be entertained. 10 . Communication: All communications will be sent to the email address provided in the application. APIS will not be responsible for any non-receipt or delays due to incorrect email IDs or technical issues. Only shortlisted candidates will be communicated for further course of selection process Terms of Engagement 1 . Contractual Nature & Tenure: The appointment shall be purely on a contractual basis for a fixed term of 1 year, extendable based on project requirements and the candidate's performance. This engagement does not confer any right to seek regularization or permanent absorption into government service. 2 . No Right to Regularization: The selected candidate shall not be entitled to regular appointment or absorption in AP Innovation Society (APIS) or its incubation centers under any circumstances. The engagement is project-ITC53-11/2/2025-MNGR - APIS I/4388235/2025 specific and shall not be construed as an offer of permanent employment or a regular government service post. 3 . Termination of Engagement: APIS reserves the right to terminate the contract at any time during the tenure by providing one month's notice or salary in lieu of notice. Immediate termination without notice may occur in cases of unsatisfactory performance, misconduct, violation of terms, or administrative exigencies. 4 . Compensation Structure: Competitive and commensurate with experience (aligned with APIS senior management pay bands). 5 . Posting Location: The initial posting will be at the discretion of APIS based on project or administrative needs. The posting location may change during the tenure, and the candidate must be willing to relocate and report promptly to the assigned location 6 . Conduct and Performance: The engaged candidate is expected to maintain high standards of integrity, discipline, and efficiency, adhering to all policies, rules, and regulations prescribed by APIS or the incubation centre. ITC53-11/2/2025-MNGR - APIS I/4388235/2025"}, "2_487c9c26fb5c4e5c8f0f8781cb4ba055_0": {"doc_id": 2, "chunk_index": 0, "chunk_text": "CHANTI LINGAMAIAH Kadapa, Andhra Pradesh, India,517172 PROFILE SUMMARY: Full Stack Developer (Entry -Level) skilled in React.js, Node.js, Express.js, Python, and SQL. Experienced in building responsive UIs, integrating RESTful APIs, and implementing secure authentication (JWT). Strong in data structures, debugging, and clean code practices, with ha nds-on experience delivering scalable web applications using modern development tools. TECHNICAL PROFICIENC Y : ● Frontend: React.js, React Router, React Hooks, JavaScript (ES6+), HTML5 .0, CSS -in-JS (styled - components ), Bootstrap , Responsive UI . ● Languages & Back -end: Node.js, Express.js, Python, REST APIs, JSON, JWT .MongoDB ● Databases: SQL (CRUD, queries), data modelling, MySQL / ● Development Tools: Git, GitHub, Chrome DevTools, JWT,VS Code ● Software Engineering Practices : OOP, Data Structures & Algorithms, REST APIs ,Responsive Design, State Management ,error handling,debugging ● Professional Skills: Verbal ,Witten & Communication,Collaboration,Problem -Solving, Adaptability & Learning , Analytical Thinking ● Methodologies: Troubleshooting & Debugging EDUCATIONDETAILS: ● B.Tech in ECE from Sri Krishna Devaraya University, Anantapur ( 2021 – 2025 ) – CGPA: 8.3 ● Intermediate (MPC) from Sri Sai Ram Junior College, Kadapa ( 2019 – 2021 ) – 97% ● SSC from Z.P.H.S Lakshmipeta, Kadapa (2018 – 2019) – CGPA: 9.7 PROJ ECT DETAILS: Project Name: FoodieHub | Github ● Developed a f ull-stack food ordering platform using React, Node.js, Express, and MySQL, allowing users to explore restaurants and menus seamlessly. ● Implemented secure user authentication with JWT tokens, enabling signup, login, and logout functionalities. ● Built restaurant and menu browsing features with category -based filtering and intuitive UI. (+91)6302024304, chantilingamaiah@gmail.com . Kadapa, Andhra Pradesh, India PIN -516172. ● Integrated RESTful APIs for user sessions, menu data retrieval, cart operations, and order tracking. ● Designed a responsive React frontend with dynamic cart updates and smooth navigation. Tech: React.js Hooks , Node.js, Express.js, MySQL, JWT, CSS, REST APIs, Full -Stack Development Project Name: Trendz – E-Commerce Platform | LiveDemo ● Built a responsive e -commerce frontend using React.js , React Router and reusable components for product listings and details. ● Integrated REST APIs for product data and implemented JWT -based session handling with LocalStorage. ● Improved UI performance by minimizing unnecessary renders and optimizing component design. Tech stack: React.js, JavaScript, CSS -in-JS (styled -components ), Bootstrap, REST APIs, JWT, Local Storage. Project Name: BankLite – Command -Line Banking Application in Python | GitHub ● Designed and developed a command -line banking system in Python allowing users to create accounts, log in securely , and perform banking operations. ● Built features for deposits, withdrawals, balance enquiries, and transaction validation to ensure accurate financial records . ● Created a user -friendly, menu -driven interface to guide users through all available operations without prior technical knowledge. ● Built a menu -driven interface to simplify operations and added robust error handling to avoid runtime crashes. Tech stack: Python, Pycharm, JSON PROFESSIONAL EXPERIENCE: ReactJS Developer Intern – CodSoft | Certificate Feb 2025 – Mar 2025 ● Implemented reusable, accessible React components and UI modules (product cards, forms, navigation) to accelerate feature rollout. ● Integrated RESTful APIs to fetch and render dynamic data,"}, "2_d830a10d1bce475a924e4150bd6fea52_1": {"doc_id": 2, "chunk_index": 1, "chunk_text": "● Built a menu -driven interface to simplify operations and added robust error handling to avoid runtime crashes. Tech stack: Python, Pycharm, JSON PROFESSIONAL EXPERIENCE: ReactJS Developer Intern – CodSoft | Certificate Feb 2025 – Mar 2025 ● Implemented reusable, accessible React components and UI modules (product cards, forms, navigation) to accelerate feature rollout. ● Integrated RESTful APIs to fetch and render dynamic data, ensuring performance and scalability. ● Managed compone nt state using useState and useEffect, improving data flow and interactivity. ● Integrated REST APIs for dynamic content rendering. ● Managed state using props and useState/ useEffect hooks. ACHIEVEMENTS : ● Tata Scholarship ( 2022 ) Awarded the prestigious Tata Scholarship worth ₹15,000 for outstanding academic performance in Intermediate (Class 12), recognizing academic excellence and consistency."}, "3_bc35b95b3c3a460d8d655bd819ef1fcf_0": {"doc_id": 3, "chunk_index": 0, "chunk_text": "JAHI RUKHI HAMSALA Analyst – Tata Consultancy Services jahirukhi.hamsala@gmail.com | +91-9391449007 Experienced GIS professional with expertise in spatial data analysis, road lane mapping, and surface elevation corrections. Proficient in GIS tools including Earth Scape and HDLM (High Definition Laser Mapping) for precise geospatial data collection and an alysis. Skilled in data mapping, automation, and alignment adjustments for infrastructure projects and car navigation systems. Seeking to leverage expertise in ArcGIS, ESRI platforms, HDLM, and web mapping technologies to contribute effectively to organization. Work Experience TCS (Tata Consultancy Services) Jan’2023 – Present GIS Specialist – Earth Scape, HDLM, and Road Lane Mapping . • Contributed to the automation of car navigation systems by delivering high -accuracy road lane mapping and surface elevation data, leveraging Earth Scape and HDLM (High Definition Laser Mapping). • Utilized LIDAR and Google Earth to resolve challenges like blurry imagery and incomplete data, ensuring precise surface models for autonomous driving applications. • Collaborated directly with clients to refine geospatial data from multiple countries, ensuring alignment and elevation corrections for optimal navigation performance. • Performed comprehensive mapping tasks including area selection, land classification, alignment accuracy, and surface elevation corrections. o Area selection and land type classification o Portal mapping for alignment accuracy and adjustments o Application of paint markings and surface elevation fixes to ensure road geometry integrity o Applied right -of-way markings on roads, identified unassigned places, and addressed obstructions on lanes. o Alignment corrections of existing map data. • Achieved 99% production quality, consistently earning client recognition for delivering reliable GIS data that enabled seamless integration into autonomous vehicle systems. TCS (Tata Consultancy Services) Aug’2022 – jan’2023 Graduate Trainee – Ignite • Completed comprehensive training in Full Stack Development, including Python, Django, and other web frameworks, gaining strong programming skills and an understanding of the software development lifecycle. • Developed web applications as part of training, applying frontend and backend development techniques using JavaScript, HTML, CSS, and Python frameworks. • Trained in business communication and soft skills, enhancing interpersonal skills, client communication, and collaborative teamwork in professional settings. • Gained valuable exposure to programmatic thinking, which improved problem -solving and analytical abilities, with a focus on developing solutions that meet client needs in dynamic IT environments. Education Details Bachelor of Science – Computer Science 2019 – 2022 Sir C R Reddy College for Women – Affiliated to AKNU – 8.50 CGPA Intermediate Education (12th) 2017 – 2019 NRI Junior college – Andhra Pradesh State Board – 8.84 CGPA Achievements • Top Performer appreciation from the client for best delivery of data more than 3 times in the year 2025 • TCS Gems awards were received for more than 10 times in the past 2 years. • Received 10+ appreciations from the client as the best trainer and best quality delivery. Skills Tools: Earth Scape | Google Earth | Map c reator Programming Skills: HTML | CSS | JavaScript | Python"}, "3_4a8dc8ff507944ddbffebad755c64dbc_1": {"doc_id": 3, "chunk_index": 1, "chunk_text": "• Received 10+ appreciations from the client as the best trainer and best quality delivery. Skills Tools: Earth Scape | Google Earth | Map c reator Programming Skills: HTML | CSS | JavaScript | Python"}}}